    // void readS()
    // {
    //     cout << "Укажите количество персон: " << endl;
    //     cin >> size;
    // }